app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
        if artist.nil?
          flash[:alert] = "Artist not found"
          redirect_to artists_path
        else
          @songs = artist.songs
        end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 3]]

  def show
    @song = Song.find_by(id: params[:id])
    if @song.nil?
      flash[:alert] = "Song not found"
      artist = Artist.find_by(id: params[:artist_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]